app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "s ketch\r\n"], ["user_id", 1], ["created_at", 2017-03-03 19:07:10 UTC], ["updated_at", 2017-03-03 19:07:10 UTC], ["picture", "wireframe-index.JPG"]]
---
  def create
  	@micropost = current_user.microposts.build(micropost_params)
  	if @micropost.save